In [53]:
import pandas as pd
import numpy as np

In [54]:
df = pd.read_csv("/Users/gayatridevadula/Downloads/Salary.csv")

In [55]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [56]:
df.tail()

    YearsExperience  Salary
30             11.2  127345
31             11.5  126756
32             12.3  128765
33             12.9  135675
34             13.5  139465

In [57]:
df.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64

In [58]:
df.describe()

       YearsExperience         Salary
count        35.000000      35.000000
mean          6.308571   83945.600000
std           3.618610   32162.673003
min           1.100000   37731.000000
25%           3.450000   57019.000000
50%           5.300000   81363.000000
75%           9.250000  113223.500000
max          13.500000  139465.000000

In [59]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [60]:
type(df)

pandas.core.frame.DataFrame

In [61]:
df.shape

(35, 2)

In [62]:
df.iloc[[3,4]]

   YearsExperience  Salary
3              2.0   43525
4              2.2   39891

In [63]:
x=df.iloc[:,:-1]
x

    YearsExperience
0               1.1
1               1.3
2               1.5
3               2.0
4               2.2
5               2.9
6               3.0
7               3.2
8               3.2
9               3.7
10              3.9
11              4.0
12              4.0
13              4.1
14              4.5
15              4.9
16              5.1
17              5.3
18              5.9
19              6.0
20              6.8
21              7.1
22              7.9
23              8.2
24              8.7
25              9.0
26              9.5
27              9.6
28             10.3
29             10.5
30             11.2
31             11.5
32             12.3
33             12.9
34             13.5

In [65]:
y=df.loc[:,'Salary']
y

0      39343
1      46205
2      37731
3      43525
4      39891
5      56642
6      60150
7      54445
8      64445
9      57189
10     63218
11     55794
12     56957
13     57081
14     61111
15     67938
16     66029
17     83088
18     81363
19     93940
20     91738
21     98273
22    101302
23    113812
24    109431
25    105582
26    116969
27    112635
28    122391
29    121872
30    127345
31    126756
32    128765
33    135675
34    139465
Name: Salary, dtype: int64

In [66]:
from sklearn.preprocessing import LabelEncoder
y=pd.DataFrame(y)
y.head()

   Salary
0   39343
1   46205
2   37731
3   43525
4   39891

In [67]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.33,random_state=42)